= Reading from Neo4j
:description: The chapter explains how to read data from a Neo4j database.

The connector provides three data source options to read data from a Neo4j database.

.Read options
[cols="1, 2, 2, 1"]
|===
|Option|Description|Value|Default

|`labels`
|Use this if you only need to xref:read/labels.adoc[read nodes] with their properties.
|Colon-separated list of node labels to read.
|_(empty)_

|`relationship`
|Use this if you need to xref:read/relationship.adoc[read relationships] along with their source and target nodes.
|Relationship type to read.
|_(empty)_

|`query`
|Use this if you need more flexibility and know how to xref:read/query.adoc[write a Cypher query].
|Cypher query with a `MATCH` clause.
|_(empty)_
|===

[#examples]
== Examples

include::partial$sparksession.adoc[]

[TIP]
====
You can run the xref:writing.adoc#examples[write examples] for each option to have some example data to read.
====

[#example-labels]
=== `labels` option

Read the `:Person` nodes.

[.tabbed-example]
====
[.include-with-Scala]
=====
.Example
[source, scala, role=nocollapse]
----
include::example$scala/read/BasicLabels.scala[tags=code]
----
=====

[.include-with-Python]
=====
.Example
[source, python, role=nocollapse]
----
include::example$python/read/basic_labels.py[tags=code]
----
=====
====

See xref:read/labels.adoc[] for more information and examples.

[#example-relationship]
=== `relationship` option

Read the `:BOUGHT` relationship with its source and target nodes and its properties.

[.tabbed-example]
====
[.include-with-Scala]
=====
.Example
[source, scala, role=nocollapse]
----
include::example$scala/read/BasicRelationship.scala[tags=code]
----
=====

[.include-with-Python]
=====
.Example
[source, python, role=nocollapse]
----
include::example$python/read/basic_relationship.py[tags=code]
----
=====
====

See xref:read/relationship.adoc[] for more information and examples.

[#example-query]
=== `query` option

Use a Cypher query to read data.

[.tabbed-example]
====
[.include-with-Scala]
=====
.Example
[source, scala, role=nocollapse]
----
include::example$scala/read/BasicQuery.scala[tags=code]
----
=====

[.include-with-Python]
=====
.Example
[source, python, role=nocollapse]
----
include::example$python/read/basic_query.py[tags=code]
----
=====
====

See xref:read/query.adoc[] for more information and examples.

== Type mapping

See xref:types.adoc[] for the full type mapping between Spark DataFrames and Neo4j.

== Performance considerations

If the schema is not specified, the Spark Connector uses xref:read/schema.adoc[sampling].

Since sampling is potentially an expensive operation, consider xref:read/schema.adoc[supplying your own schema].